# 复习 python 关键字和各种符号

# 关键字

# and
# del
# form
# not
# while
# as
# elif
# global
# or
# with
# assert
# else
# if
# pass
# yield
# break
# except
# import
# print
# class
# exec
# in
# raise
# continue
# finally
# is
# return
# def
# for
# lambda
# try

# 数据类型

# True
# False
# None
# strings
# numbers
# floats
# lists

# 字符串转移序列

# \\   ===> \
# \'   ===> '
# \"   ===> "
# \a   ===> 响铃
# \b   ===> 退格
# \f   ===> 换页
# \n   ===> 换行
# \r   ===> 回车
# \t   ===> 水平制表符
# \v   ===> 垂直制表符

# 字符串格式化

# %d ===> 有符号整数（十进制）
# %i ===> 十进制整数
# %o ===> 无符号整数（八进制）
# %u ===> 无符号整数（十进制）
# %x ===> 无符号整数（十六进制）
# %X ===> 无符号整数（十六进制大写字符）
# %e ===> 浮点数字（科学计数法）
# %E ===> 浮点数字（科学计数法，用E代替e）
# %g ===> 浮点数字（根据值得大小采用%e或%f）
# %G ===> 浮点数字（类似于%g)
# %c ===> 字符及其ASCII码
# %f ===> 浮点数字
# %F ===> 浮点数字（类似于%f）
# %r ===> 原格式输出
# %s ===> 字符串
# %% ===> 百分号标记

# 操作符号

# +  --> 加
# -  --> 减
# *  --> 乘
# **  --> 幂
# /  --> 除
# //  --> 取整除
# %  --> 取余
# <  --> 小于
# >  --> 大于
# <=  --> 小于等于
# >=  --> 大于等于
# ==  --> 等于
# !=  --> 不等于
# <>  --> 不等于
# ( )  --> 小括号，元组
# [ ]  --> 中括号，列表
# { }  --> 大括号，字典
# @  --> 函数修饰符
# ,  --> 分割前后两部分
# :  --> 函数、代码块后的语法，不可缺少
# .  --> 子集运算符
# =  --> 简单赋值运算符
# ;  --> 语句结尾 可有 可无
# +=  --> 加法赋值
# -=  --> 减法赋值
# /=  --> 除法赋值
# //=  --> 取整除赋值
# %=  --> 取余赋值
# **=  --> 幂赋值
# &  --> 按位与运算符
# |  --> 按位或运算符
# ^  --> 按位异或运算符
# ~  --> 取反运算符
# >>  --> 左移动运算符
# <<  --> 右移动运算符

